{
  "backend/main.mo": "Main Motoko actor implementing media tracking with authentication, user profiles, media entries with images, share links, banner photos, emoji reactions, and community recommendations using Map-based storage and access control.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: fixing photo upload errors in media entry forms, renaming the app to 'Mofongo Tracker', and adding global banner photo functionality.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, pages, and configuration, describing the React app with TanStack Router, authentication, media management, and cinematic OKLCH color theming.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system CSS variables for light and dark modes with warm cinematic palette (burgundy, gold, charcoal) and border/background utilities.",
  "frontend/index.html": "HTML entry point with 'Mofongo Tracker' title and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for dashboard, shared media list, and community reviews, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/AddMediaForm.tsx": "Dialog form component for creating/editing media entries with title, type, rating, review, and image upload (with validation, preview, and progress tracking) using React Query mutations.",
  "frontend/src/components/BannerPhotoUpload.tsx": "Dialog component for uploading a new global banner photo with file validation (type and 2MB size limit), preview, progress tracking, and backend mutation integration.",
  "frontend/src/components/CommunityReviewCard.tsx": "Displays a community review card with media image, title, rating bar, expandable review text, reaction bar, and reviewer profile information including formatted timestamp.",
  "frontend/src/components/ExportButton.tsx": "Renders a button that triggers project export functionality with loading state and icon, using the useProjectExport hook.",
  "frontend/src/components/Layout.tsx": "Main layout component with header (logo, navigation, login/export buttons), customizable banner photo with upload button for authenticated users, main content area, and footer with copyright and attribution links.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states, clearing query cache on logout, and error handling for duplicate authentication.",
  "frontend/src/components/MediaCard.tsx": "Displays a media entry card with image, title, rating, review, and action buttons (edit/delete) for owners, including confirmation dialog for deletion.",
  "frontend/src/components/MediaList.tsx": "Renders a grid of MediaCard components or an empty state message, determining ownership based on authenticated user identity.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time profile setup that prompts users to enter their name with form validation and submission handling.",
  "frontend/src/components/RatingBar.tsx": "Visual rating bar component that displays a colored progress bar and numeric rating, with color coding based on percentage thresholds.",
  "frontend/src/components/ReactionBar.tsx": "Displays emoji reaction buttons for reviews with counts, allowing authenticated users to add/remove reactions with optimistic UI updates.",
  "frontend/src/components/ShareMediaList.tsx": "Dialog component for generating, copying, and revoking shareable links to a user's media list. Uses mutations for link generation/revocation and displays the shareable URL with copy-to-clipboard functionality.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializing it with the user's Internet Identity and admin token. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBannerPhoto.ts": "Provides hooks for fetching and uploading banner photos using the backend actor. Handles image upload with progress tracking via ExternalBlob and invalidates queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useMediaEntries.ts": "Hooks for CRUD operations on media entries (movies, TV shows, games) including fetching user entries, creating entries, and adding images with upload progress. Update and delete operations are stubbed as not yet implemented.",
  "frontend/src/hooks/useMediaImage.ts": "Hook that retrieves and caches media entry images, handling both external blob URLs and embedded image data. Falls back to a placeholder service with deterministic colors based on title hash.",
  "frontend/src/hooks/useProjectExport.ts": "Mutation hook for generating project documentation exports including README, project structure, and metadata. Creates downloadable documentation files describing the application architecture and features.",
  "frontend/src/hooks/useReactions.ts": "Provides React Query hooks for managing emoji reactions on reviews, including fetching reaction counts, checking user reactions, and adding/removing reactions with cache invalidation.",
  "frontend/src/hooks/useReviewerProfile.ts": "Exports a hook to fetch user profile data by Principal ID using React Query, with error handling that returns null on failure.",
  "frontend/src/hooks/useReviews.ts": "Provides a React Query hook to fetch all media reviews from the backend actor.",
  "frontend/src/hooks/useShareLink.ts": "Defines hooks for share link functionality including generation, revocation, fetching shared media entries, and retrieving owner profiles; generation and revocation are not yet implemented in the backend.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching and saving the current user's profile with toast notifications and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom OKLCH color variables for light and dark themes using a warm cinematic palette with burgundy primary and gold accents.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/CommunityReviews.tsx": "Displays a grid of all community reviews sorted by date, showing profile setup if needed or requiring authentication to view.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page for authenticated users showing their personal media collection with search, sorting, and options to add media or share the collection.",
  "frontend/src/pages/SharedMediaList.tsx": "Displays a read-only view of a shared media collection accessed via share link ID from URL params, showing owner profile and entry count.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space, extended theme with custom shadows, fonts (Inter and Playfair Display), border radii, and accordion animations, plus typography, container queries, and animate plugins.",
  "project_state.json": "Project state file for 'Mofongo Tracker' tracking three completed features (photo upload error fix, app rename, and banner photo change functionality) and one pending feature request, with a known issue about photo upload errors."
}