{
  "backend/main.mo": "Main Motoko actor implementing media tracker backend with authorization, user profiles, media entry CRUD operations, sharing functionality, and access control for movies/TV shows/video games.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: investigating/resolving runtime errors and verifying search/sort functionality, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration files with their key functionality and implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with warm cinematic palette (burgundy, gold, charcoal).",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Media Tracker application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with dashboard and shared media list routes, theme provider, and toast notifications.",
  "frontend/src/components/AddMediaForm.tsx": "Dialog form component for creating and editing media entries with title, type selector, rating slider (0-10), and review textarea with validation and loading states.",
  "frontend/src/components/ExportButton.tsx": "Button component with download icon that triggers project export mutation, displaying loading spinner during export generation.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with header (logo, export button for authenticated users, login button), hero banner image, main content area, and footer with Caffeine attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button using Internet Identity hook to handle login/logout with loading states, query cache clearing, and error handling for duplicate authentication.",
  "frontend/src/components/MediaCard.tsx": "Displays a single media entry card with title, type badge, rating bar, and review excerpt. Provides edit and delete buttons for owners, with confirmation dialog for deletion.",
  "frontend/src/components/MediaList.tsx": "Renders a grid of MediaCard components from an array of media entries. Shows empty state messages when no entries exist, with different text for personal vs. shared lists.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup that prompts for a name. Cannot be dismissed until the user submits a valid name.",
  "frontend/src/components/RatingBar.tsx": "Displays a visual rating bar with color-coded progress indicator based on rating percentage. Shows numeric rating alongside the bar.",
  "frontend/src/components/ShareMediaList.tsx": "Dialog component for generating and managing shareable links to a user's media list. Allows copying the generated URL and revoking existing share links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow and identity state. Creates AuthClient with configurable options and handles identity persistence.",
  "frontend/src/hooks/useMediaEntries.ts": "Provides React Query hooks for CRUD operations on media entries (create, read, update, delete). Handles cache invalidation and displays toast notifications for operation results.",
  "frontend/src/hooks/useProjectExport.ts": "Provides a mutation hook for exporting project documentation as downloadable files (README, project structure, and package info) with metadata about the Media Tracker application.",
  "frontend/src/hooks/useShareLink.ts": "Exports hooks for generating/revoking share links and fetching shared media entries and owner profiles using TanStack Query and the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks for fetching and saving the current user's profile using TanStack Query with cache invalidation and toast notifications.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with OKLCH color system for light/dark themes featuring warm cinematic tones, burgundy primary colors, and gold accents.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying user's media collection with search, sort, add/share functionality, and conditional profile setup for authenticated users.",
  "frontend/src/pages/SharedMediaList.tsx": "Public page for viewing shared media collections via share link ID, displaying owner profile and read-only media entries with error handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space with CSS variables, extended theme settings including typography, container queries, animations, and custom font families (Inter and Playfair Display).",
  "project_state.json": "Project metadata for a media tracker application fix request, tracking two existing features related to resolving runtime errors and verifying search/sort functionality."
}