{
  "backend/main.mo": "Main Motoko actor implementing media tracking backend with authorization, user profiles, media entries (movies/TV/games), share links, and emoji reactions on reviews with CRUD operations and access control.",
  "feature_evidence.json": "Feature evidence report documenting implementation of Community Reviews page with unified feed, navigation link, dark theme styling, review cards with images, and emoji reactions across frontend components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including styling (OKLCH color system), components (Layout, MediaCard, RatingBar), pages (Dashboard, SharedMediaList, CommunityReviews), and React Query hooks for data fetching.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes featuring warm cinematic palette with burgundy primary, gold accents, and charcoal backgrounds.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Media Tracker' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard (/), SharedMediaList (/shared/:id), and CommunityReviews (/community), wrapped in ThemeProvider with Toaster for notifications.",
  "frontend/src/components/AddMediaForm.tsx": "Dialog form component for creating and editing media entries with fields for title, type selector, rating slider (0-10), and review textarea, using React Query mutations with loading states.",
  "frontend/src/components/CommunityReviewCard.tsx": "Displays a community review card with media image, title, rating bar, expandable review text, and reaction bar. Fetches reviewer profile and media images via hooks.",
  "frontend/src/components/ExportButton.tsx": "A button component that triggers project export functionality using the useProjectExport hook, showing loading state during export.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with header (logo, navigation, login/export buttons), hero banner image, main content area, and footer with Caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity authentication with login/logout functionality, clearing query cache on logout and managing loading states.",
  "frontend/src/components/MediaCard.tsx": "Displays a media entry card with title, type badge, rating bar, and review text. Includes edit/delete actions for owners with confirmation dialog.",
  "frontend/src/components/MediaList.tsx": "Renders a grid of MediaCard components from an array of entries, showing empty state message when no entries exist.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time user profile setup, requiring a name input before allowing access to the app.",
  "frontend/src/components/RatingBar.tsx": "Displays a visual rating bar with percentage-based width and color-coded styling based on rating value (gold for high, descending colors for lower).",
  "frontend/src/components/ReactionBar.tsx": "Displays emoji reaction buttons (👍❤️😂😮😢🔥) for reviews with counts, allowing authenticated users to add/remove reactions.",
  "frontend/src/components/ShareMediaList.tsx": "Dialog for generating, copying, and revoking shareable read-only links to user's media list with clipboard integration and toast notifications.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state with AuthClient and handling delegation validity checks.",
  "frontend/src/hooks/useMediaEntries.ts": "Exports React Query hooks for CRUD operations on media entries (get, create, update, delete) with toast notifications and automatic query invalidation.",
  "frontend/src/hooks/useMediaImage.ts": "Fetches placeholder images for media entries using a color-hashed placeholder service based on title, with 24-hour caching.",
  "frontend/src/hooks/useProjectExport.ts": "Provides a mutation hook to generate project documentation exports including README, structure documentation, and package metadata as downloadable content.",
  "frontend/src/hooks/useReactions.ts": "Manages emoji reactions on reviews with hooks for fetching reaction counts, checking user reactions, and adding/removing reactions with automatic cache invalidation.",
  "frontend/src/hooks/useReviewerProfile.ts": "Fetches user profile data for a given Principal with error handling and retry disabled.",
  "frontend/src/hooks/useReviews.ts": "Provides a React Query hook to fetch all media entry reviews from the backend actor.",
  "frontend/src/hooks/useShareLink.ts": "Manages share link operations including generation, revocation, fetching shared media entries by link ID, and retrieving owner profiles with toast error notifications.",
  "frontend/src/hooks/useUserProfile.ts": "Handles current user profile operations with hooks for fetching the caller's profile and saving profile updates with toast notifications.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with OKLCH color system for light/dark themes featuring warm cinematic tones, burgundy primary colors, and gold accents with custom utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/CommunityReviews.tsx": "Community Reviews page that displays all users' reviews in a grid layout, with authentication checks, profile setup prompts, and sorted reviews by date.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard page for managing personal media collection with search, sort, add/share functionality, and profile setup flow for authenticated users.",
  "frontend/src/pages/SharedMediaList.tsx": "Public shared collection view page that displays read-only media entries from a share link with owner profile information and error handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom dark theme using OKLCH colors, extended color palette with gold accents, custom shadows, typography, and animation utilities.",
  "project_state.json": "Project metadata tracking implemented features for Community Reviews page including review cards, emoji reactions, media images, and dark theme styling with architectural notes."
}