{
  "backend/main.mo": "Main Motoko actor implementing media tracking backend with user profiles, media entries (movies/TV/games), sharing functionality, and role-based access control using authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: real-time search filtering and multi-criteria sorting for media entries in the Dashboard component.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, hooks, pages, and styling for the media tracker application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a cinematic burgundy/gold/charcoal palette.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'Media Tracker'.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for dashboard and shared media list, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/AddMediaForm.tsx": "Modal dialog form component for creating and editing media entries with fields for title, type, rating slider, and review textarea.",
  "frontend/src/components/ExportButton.tsx": "Button component that triggers project export with loading state, using download icon and outline variant styling.",
  "frontend/src/components/Layout.tsx": "Application layout with header (logo, export/login buttons, hero banner), main content area, and footer with Caffeine attribution link.",
  "frontend/src/components/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/MediaCard.tsx": "Displays a single media entry (movie, TV show, or video game) as a card with title, type badge, rating bar, review excerpt, and edit/delete actions for owners.",
  "frontend/src/components/MediaList.tsx": "Renders a grid of MediaCard components or an empty state message when no entries exist, with support for read-only mode.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup, preventing dismissal until completed.",
  "frontend/src/components/RatingBar.tsx": "Displays a visual rating bar with color-coded progress (gold/green/yellow/red) based on rating percentage out of a maximum value.",
  "frontend/src/components/ShareMediaList.tsx": "Dialog component for generating, copying, and revoking shareable read-only links to a user's media list.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and auth client creation with configurable options.",
  "frontend/src/hooks/useMediaEntries.ts": "Provides React Query hooks for CRUD operations on media entries (get, create, update, delete) with automatic cache invalidation and toast notifications.",
  "frontend/src/hooks/useProjectExport.ts": "Provides a mutation hook for exporting project documentation as downloadable files (README, project structure, and package info) with metadata about the Media Tracker application.",
  "frontend/src/hooks/useShareLink.ts": "Contains React Query hooks for generating/revoking share links, fetching media entries by share link, and retrieving owner profiles for shared collections.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks for fetching and saving the current user's profile using React Query, with toast notifications for success/error states.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles with OKLCH color system, including warm cinematic light mode and charcoal dark mode themes with burgundy primary and gold accent colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying user's media collection with search, sort, add/edit forms, and share functionality; shows profile setup for new users and welcome screen for unauthenticated visitors.",
  "frontend/src/pages/SharedMediaList.tsx": "Read-only page for viewing shared media collections via share link, displaying owner's name and collection entries with error handling for invalid/expired links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space, extended theme with custom shadows, fonts (Inter and Playfair Display), border radii, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking a media browsing app with two completed features: real-time search filtering by title and a sort dropdown with multiple sorting options (title A-Z/Z-A, rating high/low, recently added)."
}