{
  "backend/main.mo": "Main Motoko actor implementing media tracking backend with access control, user profiles, media entries (CRUD operations), sharing functionality via share links and direct user shares, and authorization checks for all operations.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including media list display, add/edit forms, rating visualization, sharing interface, and Internet Identity authentication with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and configuration for the media tracker application with cinematic theming.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes featuring warm cinematic colors (burgundy, gold, charcoal) and design tokens for UI components.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for dashboard and shared media list, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/AddMediaForm.tsx": "Modal dialog form component for creating and editing media entries with fields for title, media type selector, rating slider (0-10), and review textarea with validation and loading states.",
  "frontend/src/components/Layout.tsx": "Application layout wrapper with header (logo, title, login button), conditional hero banner for authenticated users, main content area, and footer with Caffeine attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component managing Internet Identity login/logout with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/MediaCard.tsx": "Displays a single media entry (movie, TV show, or video game) as a card with title, type badge, rating bar, review excerpt, and edit/delete actions for owners.",
  "frontend/src/components/MediaList.tsx": "Renders a grid of MediaCard components or an empty state message when no entries exist, with support for read-only mode.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup, preventing dismissal until completed.",
  "frontend/src/components/RatingBar.tsx": "Displays a visual rating bar with color-coded progress (gold/green/yellow/red) based on percentage of max rating.",
  "frontend/src/components/ShareMediaList.tsx": "Dialog component for generating shareable read-only links to a user's media list, with copy-to-clipboard and revoke functionality.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing AuthClient lifecycle and identity persistence across page reloads.",
  "frontend/src/hooks/useMediaEntries.ts": "React Query hooks for CRUD operations on media entries (get, create, update, delete) with automatic cache invalidation and toast notifications.",
  "frontend/src/hooks/useShareLink.ts": "React Query hooks for managing share links: generating, revoking, fetching shared media entries by link ID, and retrieving owner profiles.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the current user's profile with automatic cache invalidation and toast notifications.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a warm cinematic theme featuring burgundy, gold, and charcoal colors in both light and dark modes, plus typography settings using Inter and Playfair Display fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that displays the authenticated user's media collection with options to add, edit, and share entries; shows profile setup for new users and a welcome message for unauthenticated visitors.",
  "frontend/src/pages/SharedMediaList.tsx": "Read-only page that displays a shared media collection accessed via a share link ID from the URL, showing the owner's name and their entries with error handling for invalid links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH color space, custom shadows, font families, and animations for the media tracker's warm cinematic design system.",
  "project_state.json": "Project metadata tracking completed features for a media tracking app including frontend display, forms, rating components, sharing interface, Internet Identity authentication, and cinematic visual design."
}