{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix photo upload error, rename app to Mofongo Tracker, and add banner photo customization",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the error that occurs after uploading photos in the media entry form to ensure images are properly stored and displayed without errors",
      "acceptanceCriteria": [
        "Users can upload photos to media entries without encountering errors",
        "Uploaded photos are successfully stored in the backend",
        "Uploaded photos display correctly in MediaCard and CommunityReviewCard components",
        "No console errors or failed network requests after photo upload"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AddMediaForm.tsx",
          "operation": "modify",
          "description": "Fix image upload handling in the form submission. Ensure the image upload mutation completes successfully before attempting to create the media entry. Update error handling to catch and display any upload failures. Verify the ExternalBlob is properly constructed from the file data before passing to the backend."
        },
        {
          "path": "frontend/src/hooks/useMediaEntries.ts",
          "operation": "modify",
          "description": "Fix the addImageToMediaEntry mutation to properly handle the ExternalBlob upload with progress tracking. Ensure the mutation invalidates the correct query keys after successful upload so the UI updates with the new image."
        },
        {
          "path": "frontend/src/components/MediaCard.tsx",
          "operation": "modify",
          "description": "Verify image display logic handles external blob URLs correctly. Ensure the component properly renders images from ExternalBlob sources returned by the backend."
        },
        {
          "path": "frontend/src/components/CommunityReviewCard.tsx",
          "operation": "modify",
          "description": "Verify image display logic handles external blob URLs correctly. Ensure the component properly renders images from ExternalBlob sources returned by the backend."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Rename the application from 'Media Tracker' to 'Mofongo Tracker' in all user-facing locations",
      "acceptanceCriteria": [
        "The browser tab title displays 'Mofongo Tracker'",
        "The header logo area shows 'Mofongo Tracker'",
        "All references to 'Media Tracker' in the UI are updated to 'Mofongo Tracker'"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the <title> tag from 'Media Tracker' to 'Mofongo Tracker'."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update the header logo text from 'Media Tracker' to 'Mofongo Tracker'. Search for any other references to 'Media Tracker' in the component and replace them with 'Mofongo Tracker'."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add functionality for any user to change the banner photo that is displayed globally for all users in the Layout component header area",
      "acceptanceCriteria": [
        "A UI control is added (e.g., button or admin panel option) that allows users to upload a new banner image",
        "The uploaded banner image is stored in the backend and persists across sessions",
        "When a user changes the banner, it updates immediately for all users viewing the application",
        "The banner image displays correctly in the Layout component's hero section"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBannerPhoto.ts",
          "operation": "create",
          "description": "Create a new hook file that provides React Query hooks for banner photo operations. Include useGetBannerPhoto to fetch the current banner using getBannerPhoto backend method, and useSetBannerPhoto mutation to upload a new banner using setBannerPhoto backend method. The mutation should accept an ExternalBlob parameter and invalidate the banner query on success. Use the blob-storage component's ExternalBlob class to handle file uploads with progress tracking."
        },
        {
          "path": "frontend/src/components/BannerPhotoUpload.tsx",
          "operation": "create",
          "description": "Create a dialog component for uploading a new banner photo. Include a file input that accepts images, shows a preview of the selected image, displays upload progress, and calls the useSetBannerPhoto mutation on submit. Add validation for file type (images only) and size (2MB limit). Show toast notifications on success or error. Use the blob-storage component to construct ExternalBlob from file data and track upload progress. Verify the component's usage instructions for ExternalBlob before implementing."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update the hero banner section to display the banner photo from the backend. Use the useGetBannerPhoto hook to fetch the current banner URL. If a banner exists, display it using ExternalBlob.getDirectURL() to leverage streaming and caching. Add a button or icon in the header area that opens the BannerPhotoUpload dialog when clicked. Use the existing generated banner image at frontend/public/assets/generated/hero-banner.dim_1200x400.png as the fallback when no custom banner is set."
        }
      ]
    }
  ]
}