{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add search and sort functionality for media entries",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a search input field above the media grid that filters media entries by title in real-time as the user types",
      "acceptanceCriteria": [
        "Search input appears above the media grid on the Dashboard page",
        "Typing in the search field filters visible media entries by matching title text (case-insensitive)",
        "Search results update in real-time as the user types",
        "Empty search shows all media entries",
        "Search preserves when switching between tabs or refreshing if applicable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Add state management for search query using useState. Add a search input field above the MediaList component using shadcn/ui Input component. Implement real-time filtering logic that filters the media entries array by checking if the search query (case-insensitive) is included in the media entry title. Pass the filtered entries to the MediaList component. Position the search input in a controls section above the media grid alongside the existing add media button."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a sort dropdown that allows users to sort media entries by: Title (A-Z), Title (Z-A), Rating (Highest First), Rating (Lowest First), and Recently Added",
      "acceptanceCriteria": [
        "Sort dropdown appears above the media grid alongside the search input",
        "Dropdown includes options: Title (A-Z), Title (Z-A), Rating (Highest First), Rating (Lowest First), Recently Added",
        "Selected sort order immediately reorders the displayed media entries",
        "Sort order persists when search filters are applied",
        "Default sort order is Recently Added"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Add state management for selected sort option using useState with default value 'recently-added'. Add a shadcn/ui Select component next to the search input with options for: 'Title (A-Z)', 'Title (Z-A)', 'Rating (Highest First)', 'Rating (Lowest First)', and 'Recently Added'. Implement sorting logic that applies after search filtering: sort by title alphabetically (ascending/descending), by rating (descending/ascending, handling optional ratings by treating null as 0), or by dateAdded (descending for recently added). Ensure the sort is applied to the filtered results from REQ-1. Arrange search input and sort dropdown in a flex container above the MediaList component."
        }
      ]
    }
  ]
}